app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "new article"], ["text", "forreal tho"], ["created_at", "2015-08-17 23:25:58.846384"], ["updated_at", "2015-08-17 23:25:58.846384"]]
---
  def create
  	# render plain: params[:article].inspect
  	@article = Article.new(article_params)

  	if @article.save